BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega8HVA.PIC
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnn" edc:cname="CADRC" edc:nzwidth="0x8" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:AdjustPoint edc:_addr="0xE7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CADIC" edc:nzwidth="0x10" ltx:memberofperipheral="COULOMB_COUNTER"/>
        <edc:AdjustPoint edc:_addr="0xEA" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0xF0" edc:access="----nnnn" edc:cname="FCSR" edc:nzwidth="0x8" ltx:memberofperipheral="FET">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CFE" edc:desc="Charge FET Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFE" edc:desc="Discharge FET Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CPS" edc:desc="Current Protection Status" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DUVRD" edc:desc="Deep Under-Voltage Recovery Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF1" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xF2" edc:access="---nnnnn" edc:cname="BPIMSK" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHCIE" edc:desc="Charger High-current Protection Activated Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DHCIE" edc:desc="Discharger High-current Protection Activated Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COCIE" edc:desc="Charge Over-current Protection Activated Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOCIE" edc:desc="Discharge Over-current Protection Activated Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIE" edc:desc="Short-circuit Protection Activated Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF3" edc:access="---nnnnn" edc:cname="BPIFR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHCIF" edc:desc="Charge High-current Protection Activated Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DHCIF" edc:desc="Disharge High-current Protection Activated Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COCIF" edc:desc="Charge Over-current Protection Activated Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOCIF" edc:desc="Discharge Over-current Protection Activated Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCIF" edc:desc="Short-circuit Protection Activated Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF4" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xF5" edc:access="nnnnnnnn" edc:cname="BPSCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="BPDOCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xF7" edc:access="nnnnnnnn" edc:cname="BPCOCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnn" edc:cname="BPDHCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xF9" edc:access="nnnnnnnn" edc:cname="BPCHCD" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xFA" edc:access="nnnnnnnn" edc:cname="BPSCTR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xFB" edc:access="nnnnnnnn" edc:cname="BPOCTR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xFC" edc:access="nnnnnnnn" edc:cname="BPHCTR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION"/>
        <edc:SFRDef edc:_addr="0xFD" edc:access="---nnnnn" edc:cname="BPCR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHCD" edc:desc="Charge High-current Protection Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DHCD" edc:desc="Discharge High-current Protection Disable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COCD" edc:desc="Charge Over-current Protection Disabled" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOCD" edc:desc="Discharge Over-current Protection Disabled" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCD" edc:desc="Short Circuit Protection Disabled" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFE" edc:access="------nn" edc:cname="BPPLR" edc:nzwidth="0x8" ltx:memberofperipheral="BATTERY_PROTECTION">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BPPL" edc:desc="Battery Protection Parameter Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BPPLE" edc:desc="Battery Protection Parameter Lock Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:beginaddr="0x100" edc:endaddr="0x300" edc:regionid="IRAM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:DataFlashSpace edc:endaddr="0x400" edc:magicoffset="0x810000"/>
  <edc:SignaturesSpace edc:magicoffset="0x840000">
    <edc:DeviceIDSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="SIGNATURES" edc:value="0x1E9310"/>
  </edc:SignaturesSpace>
  <edc:FusesSpace edc:magicoffset="0x820000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnn" edc:cname="LOW" edc:factorydefault="0xDF" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SUT" edc:desc="Select start-up time" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_4MS" edc:desc="Start-up time 6 CK/14 CK + 4 ms" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_8MS" edc:desc="Start-up time 6 CK/14 CK + 8 ms" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_16MS" edc:desc="Start-up time 6 CK/14 CK + 16 ms" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_32MS" edc:desc="Start-up time 6 CK/14 CK + 32 ms" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_64MS" edc:desc="Start-up time 6 CK/14 CK + 64 ms" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_128MS" edc:desc="Start-up time 6 CK/14 CK + 128 ms" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_256MS" edc:desc="Start-up time 6 CK/14 CK + 256 ms" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:DCRFieldSemantic edc:cname="6CK_14CK_512MS" edc:desc="Start-up time 6 CK/14 CK + 512 ms" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SELFPRGEN" edc:desc="Self Programming enable" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="DWEN" edc:desc="Debug Wire enable" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1"/>
            <edc:DCRFieldDef edc:cname="WDTON" edc:desc="Watch-dog Timer always on" edc:nzwidth="0x1"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0x830000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="------nn" edc:cname="LOCKBIT" edc:factorydefault="0x0" edc:impl="0x3" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="LB" edc:desc="Memory Lock" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PROG_VER_DISABLED" edc:desc="Further programming and verification disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PROG_DISABLED" edc:desc="Further programming disabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No memory lock features enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
</edc:PIC>